# Написати програму, яка переміщає всі нулі у кінець списку.
# Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
# Порядок ненульових чисел має зберегтися!
# Приклад:
# [0, 1, 0, 12, 3] -> [1, 12, 3, 0, 0]
# [0] -> [0]
# [1, 0, 13, 0, 0, 0, 5] -> [1, 13, 5, 0, 0, 0, 0]
# [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]
# Для перевірки коректності роботи Вашого коду використовуйте приклади вище. Робити запит на введення даних від користувача не потрібно.

numbers = [0, 1, 0, 12, 3]

non_zero_numbers = []
zeros = []

for number in numbers:
    if number != 0:
        non_zero_numbers.append(number)
    else:
        zeros.append(number)

non_zero_numbers.extend(zeros)

print(non_zero_numbers)